icla0/xiaozhi-esp32/sdkconfig.defaults
# =============================================================================
# Nora — sdkconfig.defaults for xiaozhi-esp32 firmware
# =============================================================================
# Place this file in the ROOT of the xiaozhi-esp32 project directory.
# Run `idf.py set-target esp32s3` to merge these defaults into sdkconfig.
#
# Custom wake word "Hi Nora" requires building from source (no prebuilt firmware).
# =============================================================================

# ── IDF Target ────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ── Partition Table ────────────────────────────────────────────────────────
# Binary is ~3MB, use custom partition table with 4MB factory (16MB flash)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# ── Board Type: Waveshare ESP32-S3-Touch-LCD-1.85C ────────────────────────
CONFIG_BOARD_TYPE_WAVESHARE_ESP32_S3_TOUCH_LCD_1_85C=y

# ── Board Version: v2.0 (ES8311 codec + ES7210 mic, shared I2S bus) ───────
# v1.0 uses separate I2S lines for mic and codec.
# v2.0 shares a single I2S bus (most boards sold after 2024 are v2.0).
# To identify: check the silk-screen on the back of the board, or the seller's
# product page. If unsure, try v2.0 first; if audio is garbled, switch to v1.0.
CONFIG_VERSION_2_0=y

# ── PSRAM (required for custom wake word — MultiNet models live in PSRAM) ──
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# ── Flash Size ────────────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ── Custom Wake Word "Hi Nora" ────────────────────────────────────────────
# CONFIG_USE_CUSTOM_WAKE_WORD=y enables the custom MultiNet wake word feature.
# English wake phrases require the English MultiNet7 model (mn7_en):
#   - CONFIG_SR_MN_EN_MULTINET7_QUANT=y selects mn7_en (~2.6MB, lives in the
#     "model" flash partition — partitions.csv must contain a partition named
#     "model", otherwise no model is flashed and wake word init fails).
#   - esp_mn_commands_add() runs flite_g2p() text→phoneme conversion only
#     under MULTINET7_QUANT, so plain text like "Hi Nora" works with mn7_en.
# Multiple phrases are comma-separated (parsed in custom_wake_word.cc).
#
# CONFIG_CUSTOM_WAKE_WORD_DISPLAY is the text shown on the LCD screen.
CONFIG_USE_CUSTOM_WAKE_WORD=y
CONFIG_CUSTOM_WAKE_WORD_LANGUAGE="en"
CONFIG_CUSTOM_WAKE_WORD="Hi Nora,Hey Nora"
CONFIG_CUSTOM_WAKE_WORD_DISPLAY="Hi Nora,Hey Nora"
CONFIG_CUSTOM_WAKE_WORD_THRESHOLD=20
CONFIG_SR_MN_EN_MULTINET7_QUANT=y

# ── OTA URL (replace SPARK_IP with your spark machine's LAN IP) ────────────
# The device contacts this URL on first boot to activate and receive config.
CONFIG_OTA_URL="http://10.0.0.118:8002/xiaozhi/ota/"

# ── WiFi Provisioning: AP Hotspot Mode ────────────────────────────────────
# On first boot with no saved WiFi, the device creates an AP hotspot.
# The hotspot name is "Xiaozhi-XXXX" (last 4 of MAC).
# Connect to it from a phone/laptop, then open the URL shown on screen
# in a browser to enter your WiFi SSID and password via a web form.
# NOTE: There is NO QR code — provisioning is text + AP hotspot based.
CONFIG_USE_HOTSPOT_WIFI_PROVISIONING=y

# ── Display ───────────────────────────────────────────────────────────────
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_LV_USE_IMGFONT=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LANGUAGE_EN_US=y
